Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/powermgmt/powermgmt.c
/******************************************************************************
* DISCLAIMER

* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized.

* This software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.

* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES
* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY,
* INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
* PARTICULAR PURPOSE AND NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY
* DISCLAIMED.

* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES
* FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS
* AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.

* Renesas reserves the right, without notice, to make changes to this
* software and to discontinue the availability of this software.
* By using this software, you agree to the additional terms and
* conditions found by accessing the following link:
* http://www.renesas.com/disclaimer
******************************************************************************/
/* Copyright (C) 2011 Renesas Electronics Corporation. All rights reserved.  */
/******************************************************************************
* File Name    : powermgmt.c
* Version      : 1.00
* Device(s)    : None
* Tool-Chain   : CubeSuite+
* H/W Platform : Unified Energy Meter Platform
* Description  : Power Management Module
******************************************************************************
* History : DD.MM.YYYY Version Description
*         : 24.06.2013
******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
/* Driver */
#include "r_cg_macrodriver.h"           /* CG Macro Driver */
#include "r_cg_userdefine.h"            /* CG User define */
#include "r_cg_cgc.h"                   /* CG CGC Driver */
#include "r_cg_rtc.h"                   /* CG RTC Driver */
#include "r_cg_sau.h"                   /* CG Serial Driver */
#include "r_cg_dsadc.h"                 /* CG DSADC Driver */
#include "r_cg_wdt.h"                   /* CG WDT Driver */
#include "r_cg_lcd.h"                   /* CG LCD Driver */
#include "r_cg_iica.h"                  /* CG COMP Driver */
#include "r_cg_lvd.h"                   /* CG LVD Driver */

/* Standard library */
#include <string.h>
#include <stdio.h>
#include <stdarg.h>

/* Wrapper/User */
#include "wrp_em_mcu.h"                    /* Wrapper/MCU */
#include "wrp_app_ext.h"
#include "wrp_em_sw_config.h"

/* MW/Core */
#include "em_main.h"                    /* Metrology main loading */
#include "em_core.h"                    /* EM Core APIs */

/* Application */
#include "platform.h"                   /* Platform information header file */
#include "startup.h"                    /* Start up header file */
#include "powermgmt.h"                  /* Power Management Header File */
#include "standby.h"
#include "r_lcd_display.h"              /* LCD display header file */
#include "em_display.h"                 /* LCD parameter header file */
#include "event.h"                      /* Event header file */
#include "r_tariff.h"
#include "r_loadsurvey.h"
#include "inst_read.h"
#include "r_abnormal_operating.h"
#include "storage.h"                    /* Storage header file */
#ifdef _DLMS
#include "r_dlms_event.h"
#endif
#include "key.h"

/******************************************************************************
Macro definitions
******************************************************************************/

/* Control power management operation */
#define POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE                   TRUE        /* Default: True */
#define POWERMGMT_USING_DEBUG_CONTROL_FLAG                          FALSE       /* Default: False */
#define POWERMGMT_DISPLAY_LCD_DEBUG_SYMBOL                          FALSE       /* Default: False */
#define POWERMGMT_ENABLE_DEBUG_PRINT                                FALSE       /* Default: False */
#define POWERMGMT_DEBUG_PRINT_BAUDRATE                              SAU_STD_BAUD_RATE_19200
#define EM_SW_PROPERTY_OPERATION_DEFAULT_NM_VOLTAGE                 (220.0f)    /* Volt */
#define EM_SW_PROPERTY_OPERATION_NM_POWER_THRESHOLD                 (0.5f * EM_SW_PROPERTY_OPERATION_DEFAULT_NM_VOLTAGE)

#if (POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE)
#define POWERMGMT_STANDBY_CALCULATE_ENABLE_DELAY                    FALSE       /* Enable delay in Standby processing to observer current consumption */
#define POWERMGMT_STANDBY_DELAY_RELEASE_EVENT                       (3)         /* x amount of seconds to release NM standby event */
#define POWERMGMT_STANDBY_INTERVAL_HIGH                             (1)         /* Standby sampling interval when load detected (in seconds) */
#define POWERMGMT_STANDBY_INTERVAL_LOW                              (60)        /* Standby sampling interval when no load (in seconds) */
#endif /* POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE */

#if (POWERMGMT_USING_DEBUG_CONTROL_FLAG == TRUE)
/* Debug */
#define POWERMGMT_DIRECT_IS_VDD_LOW()                               (g_powermgmt_debug_flag.lvdvddf    == 1U)
#define POWERMGMT_DIRECT_IS_EXLVD_LOW()                             (g_powermgmt_debug_flag.lvdexlvdf  == 1U)
#else
/* Power mamnagement mode flag checking */
#define POWERMGMT_DIRECT_IS_VDD_LOW()                               (LVDVDDF    == 1U)
#define POWERMGMT_DIRECT_IS_EXLVD_LOW()                             (LVDEXLVDF  == 1U)
#endif /* POWERMGMT_USING_DEBUG_CONTROL_FLAG == TRUE */

