Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/powermgmt/powermgmt.c
/******************************************************************************
Typedef definitions
******************************************************************************/
typedef struct
{
    uint8_t is_rtc_int                  :1;         /* Flag to detect RTC period wake up source */
    uint8_t is_alarm_int                :1;         /* Flag to detect RTC alarm wakeup source */
    uint8_t is_vdd_low                  :1;         /* Flag to detect VDD Voltage Low */
    uint8_t is_ac_low                   :1;         /* Flag to detect AC Power Low */

} powermgmt_int_flag_t;

typedef struct tagPowerMgmtStandByControl
{
    uint8_t interval;
    uint16_t delay_release_count;
} powermgmt_standby_control_t;

#if (POWERMGMT_USING_DEBUG_CONTROL_FLAG == TRUE)
typedef struct tagPowermgmtDebugFlag
{
    uint8_t lvdvddf;
    uint8_t lvdexlvdf;
} powermgmt_debug_flag;
#endif

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/
/* From r_cg_systeminit.c */
extern void R_Systeminit(void);

#if (POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE)
/* Import from wrp_em_adc.c */
extern EM_SAMPLES g_wrp_adc_samples;
extern void (NEAR_PTR * g_wrp_adc_basic_signal_ready_cb_and_return)(void);
#endif

/* Import from r_cg_intp_user.c */
extern volatile uint8_t g_intp_case_open_flag;

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Private global variables and functions
******************************************************************************/
static powermgmt_mode_t        g_powermgmt_current_mode = POWERMGMT_MODE1;
static powermgmt_int_flag_t    g_powermgmt_flag;

#if (POWERMGMT_USING_DEBUG_CONTROL_FLAG == TRUE)
static volatile powermgmt_debug_flag g_powermgmt_debug_flag;
#endif /* POWERMGMT_USING_DEBUG_CONTROL_FLAG == TRUE */

#if (POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE)
static powermgmt_standby_control_t g_powermgmt_standby_control;
#endif /* POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE */

static void eeprom_enable(void)
{
    SET_BIT(P3, 0, 1);
    IICA0EN = 1U;
    P6 &= 0xFCU;
    PM6 &= 0xFCU;
    R_IICA0_Start();
}
static void eeprom_disable(void)
{
    R_IICA0_Stop();
    P6 &= 0xFCU;
    PM6 |= 0x03U;
    IICA0EN = 0U;
    SET_BIT(P3, 0, 0);
}
static void standby_start(void)
{
    DSADCEN = 1U;
    MACEN = 1U;
    R_DSADC_BackupPhaseRegSetting();
    R_DSADC_StartCurrentChannels();
}
static void standby_stop(void)
{
    R_DSADC_Stop();
    R_DSADC_RestorePhaseRegSetting();
    DSADCEN = 0U;
    MACEN = 0U;
}
#if (POWERMGMT_ENABLE_DEBUG_PRINT == TRUE)
static void printf_uart0(const char *format, ...)
{
    #define CMD_PRINTF_MAX_STR_LENGTH       200

    uint8_t     buffer[CMD_PRINTF_MAX_STR_LENGTH];  /* max bytes */
    va_list     arg = NULL;
    uint16_t    usndone;
    uint16_t    send_length;
    uint8_t *   p_send_buffer;

    #ifdef __CA78K0R__
    /* Parse the argument list, print to buffer string */
    va_starttop(arg, format);
    #endif

    #ifdef __CCRL__
    va_start(arg, format);
    #endif

    /* Format the string */
    usndone = vsprintf((char *)buffer, (const char *)format, arg);
    buffer[CMD_PRINTF_MAX_STR_LENGTH-1] = 0;    /* Terminal string to prevent un-expected error */

    /* Send string */
    p_send_buffer = buffer;
    send_length = strlen((const char *)buffer);
    R_WDT_Restart();
    while (send_length > 0)
    {
        TXD0 = *p_send_buffer;
        while(SSR00 & 0x0040);

        R_WDT_Restart();

        p_send_buffer++;
        send_length--;
    }
    R_WDT_Restart();

    va_end(arg);
}
#else
#define printf_uart0              {;}
#endif /* #if (POWERMGMT_ENABLE_DEBUG_PRINT == TRUE) */

static void powermgmt_capture_rtc_calendar_counter_to_EventArgs(void)
{
    rtc_counter_value_t rtctime;
    
    R_RTC_Get_CalendarCounterValue(&rtctime);

    EventArgs.data.captured_time.Sec    = WRP_EXT_Bcd2Dec(rtctime.sec);
    EventArgs.data.captured_time.Min    = WRP_EXT_Bcd2Dec(rtctime.min);
    EventArgs.data.captured_time.Hour   = WRP_EXT_Bcd2Dec(rtctime.hour);
    EventArgs.data.captured_time.Day    = WRP_EXT_Bcd2Dec(rtctime.day);
    EventArgs.data.captured_time.Week   = WRP_EXT_Bcd2Dec(rtctime.week);
    EventArgs.data.captured_time.Month	= WRP_EXT_Bcd2Dec(rtctime.month);
    EventArgs.data.captured_time.Year   = WRP_EXT_Bcd2Dec(rtctime.year);
}

#if (POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE)
/******************************************************************************
* Function Name : standby_dsad_callback
* Interface     : static void standby_dsad_callback(void)
* Description   :
* Arguments     : None
* Return Value  : None
******************************************************************************/
static void NEAR_PTR standby_dsad_callback(void)
{
    EM_STANDBY_ADCInterruptCallback(g_wrp_adc_samples.i1, g_wrp_adc_samples.i2);
}

/******************************************************************************
* Function Name : POWERMGMT_SetSamplingInterval
* Interface     : static void POWERMGMT_SetSamplingInterval(void)
* Description   :
* Arguments     : None
* Return Value  : None
******************************************************************************/
PWR_FUNC static void POWERMGMT_SetSamplingInterval(uint8_t sec)
{
    uint16_t i;
    rtc_counter_value_t current_time;
    rtc_alarm_value_t setting_time;
    uint8_t set_new_time = FALSE;

    if ( (sec >= 1) && (sec <= 60) ) 
    {
        memset(&setting_time, 0, sizeof(rtc_counter_value_t));
        memset(&setting_time, 0, sizeof(rtc_alarm_value_t));

        R_RTC_Get_CalendarCounterValue(&current_time);

        /* Special case when setting 60s
        * If set the alarm time seconds equal to current seconds,
        * The interrupt for alarm will raise, making the interrupt duplicate
        */
        if (sec == 60) {
            if (g_powermgmt_standby_control.interval != sec) {
                /* Wait a while (>1s) */
                for (i = 0; i < 25; i++)
                {
                    MCU_Delay(50000);
                }
                setting_time.alarmws = current_time.sec;
                set_new_time = TRUE;
            }
        }
        else {
            /* Add next few seconds */
            setting_time.alarmws = WRP_EXT_Bcd2Dec(current_time.sec) + sec;
            setting_time.alarmws %= 60;
            setting_time.alarmws = WRP_EXT_Dec2Bcd(setting_time.alarmws);
            set_new_time = TRUE;
        }

        if (set_new_time == TRUE) {
            R_RTC_Set_CalendarAlarm0Value(setting_time);
			R_RTC_Set_CalendarAlarm0On(1);
        }
        g_powermgmt_standby_control.interval = sec;
    }
}

