Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/powermgmt/powermgmt.c
/******************************************************************************
* Function Name : POWERMGMT_StandBy_Calculate
* Interface     : static void POWERMGMT_StandBy_Calculate(void)
* Description   :
* Arguments     : None
* Return Value  : None
******************************************************************************/
PWR_FUNC static void POWERMGMT_StandBy_Calculate(void)
{
    float32_t power;
    EM_CALIBRATION calib = EM_GetCalibInfo();
    uint16_t i;

    standby_start();

    /* Debug only */
    #if (POWERMGMT_ENABLE_DEBUG_PRINT == 1)
    /* Turn on UART0 */
    SAU0EN = 1U;
    R_UART0_Create();
    R_UART0_SetBaudRate(POWERMGMT_DEBUG_PRINT_BAUDRATE);
    R_UART0_Start();

    /* Calculation time measurement timer */
    TAU0EN = 1U;
    LOADTEST_TAU_Init();
    LOADTEST_TAU_SetCKM0Divider(_0004_TAU_CKM0_fCLK_4);

    LOADTEST_TAU_Start();
    #endif /* #if (POWERMGMT_ENABLE_DEBUG_PRINT == 1) */
    
    g_wrp_adc_basic_signal_ready_cb_and_return = standby_dsad_callback;
    power = EM_STANDBY_CalculatePowerAndSignals(
        EM_SW_PROPERTY_OPERATION_DEFAULT_NM_VOLTAGE,
        calib.coeff.i1rms,
        calib.coeff.i2rms
    );
    
    #if (POWERMGMT_ENABLE_DEBUG_PRINT == 1)
    LOADTEST_TAU_Stop();
    #endif
    
    #if (POWERMGMT_STANDBY_CALCULATE_ENABLE_DELAY == TRUE)
    for (i = 0; i < POWERMGMT_STANDBY_DELAY_CYCLE_OF_CALCULATION; i++)
    {
        power = EM_STANDBY_CalculatePowerAndSignals(
            EM_SW_PROPERTY_OPERATION_DEFAULT_NM_VOLTAGE,
            calib.coeff.i1rms,
            calib.coeff.i2rms
        );
    }
    #endif /* #if (POWERMGMT_STANDBY_CALCULATE_ENABLE_DELAY == TRUE) */
    g_wrp_adc_basic_signal_ready_cb_and_return = NULL;

    /* In case not need pulse output, stop immediately to save power */
    standby_stop();
    
    /* Add energy to current tariff if greater than preset power */
    if (power >= EM_SW_PROPERTY_OPERATION_NM_POWER_THRESHOLD)
    {
        float32_t irms = (EM_STANDBY_GetCurrent1() >= EM_STANDBY_GetCurrent2()) ? \
                            EM_STANDBY_GetCurrent1() :\
                            EM_STANDBY_GetCurrent2();
        POWERMGMT_SetSamplingInterval(POWERMGMT_STANDBY_INTERVAL_HIGH);
        R_BLOCKLOAD_AddSampleOfStandbyMode(EM_SW_PROPERTY_OPERATION_DEFAULT_NM_VOLTAGE);
        /* Update energy to system */
        R_INST_UpdateEnergyByPowerAndTime(power, g_powermgmt_standby_control.interval);

        /* Logging need access EEPROM */
        eeprom_enable();
        
        /* NeutralMissing occur */
        if (g_event_state.neutral_missing.current_state == EVENT_STATE_RELEASE) 
        {
            /* Assert event */
            EVENT_NeutralMissing(EVENT_STATE_ENTER);
            
            /* Log event with custom parameters to EventArgs
            *       current RTC calendar counter, 
            *       default neutral missing voltage, 
            *       calculated standby irms, 
            *       PF 1 UNITY
            */
            powermgmt_capture_rtc_calendar_counter_to_EventArgs();
            EventArgs.data.voltage 			    = EM_SW_PROPERTY_OPERATION_DEFAULT_NM_VOLTAGE;
            EventArgs.data.ActiveEnergyImport   = R_TARIFF_GetImportActiveEnergyTotal();
            EventArgs.data.current              = irms;
            EventArgs.data.PF                   = 1;
            EVENT_Logging();
            
            /* Backup event state to prevent reset during sleep */
            EVENT_StorageBackup();
        }
        else {
            /* Same state, not assert event */
        }
    
        R_HANDLER_MeterWakeup();
        
        /* Backup processed state of applications */
        STORAGE_Backup(STORAGE_ITEM_SYS_STATE);
    }
    else
    {
        POWERMGMT_SetSamplingInterval(POWERMGMT_STANDBY_INTERVAL_LOW);
    }

    eeprom_disable();

    /* Debug only */
    #if (POWERMGMT_ENABLE_DEBUG_PRINT == 1)
    {
        uint16_t diff;
        float32_t calculation_time;
        float32_t kwh;
        rtc_counter_value_t rtctime;
        
        printf_uart0("\n\r");
        
        diff = LOADTEST_TAU_Diff();
        calculation_time = ((
                                ((float)diff * (float)(LOADTEST_TAU_GetCKM0Divider(0))) /
                                (float)(LOADTEST_CGC_GetClock())
                             ) / 1000.0f) * 1e6;
                             
        printf_uart0(">> Calculation time = %f (us)\n\r", calculation_time);
            
        printf_uart0(">> Measured power = %f\n\r", power);
        printf_uart0(">> Current 1      = %f\n\r", EM_STANDBY_GetCurrent1());
        printf_uart0(">> Current 2      = %f\n\r", EM_STANDBY_GetCurrent2());
        printf_uart0(">> Total sample   = %d\n\r", EM_STANDBY_GetTotalSample());
        
        eeprom_enable();
        kwh = R_TARIFF_GetImportActiveEnergyTotal();
        eeprom_disable();
        printf_uart0(">> KWh Counter    = %f\n\r", kwh);

        printf_uart0(">> Neutral missing state = %s \n\r", (g_event_state.neutral_missing.current_state == EVENT_STATE_ENTER) ? "Entered" : "Released" );
        
        /* Display current time for interval checking */
        R_RTC_Get_CalendarCounterValue(&rtctime);
        printf_uart0(">> Current time: %02x:%02x:%02x \n\r", rtctime.hour, rtctime.min, rtctime.sec);
        
        LOADTEST_TAU_DeInit();
    }
    #endif /* #if (POWERMGMT_ENABLE_DEBUG_PRINT == 1) */

    /* The started peripheral will be turn off in mode process again */
}
#endif /* POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE */

/******************************************************************************
* Function Name : POWERMGMT_SWDelayFor3Seconds
* Interface     : static void POWERMGMT_SWDelayFor3Seconds(void)
* Description   : Delay for 3 seconds in fIL clock (~15kHz) then switch back to fIH clock
* Arguments     : None
* Return Value  : None
******************************************************************************/
PWR_FUNC static void POWERMGMT_SWDelayFor3Seconds(void)
{
    uint16_t count;

    /* This delay assume that fSUB is selected as CPU clock before calling,
     * else, this will not function correctly
     * Which one is using as fSUB:
     * SELLOSC = 0: fSX (~32kHz)
     * SELLOSC = 1: fIL (~15kHz)
    */
    {
        R_CGC_FclkUseFsub();
        count = 5000;
    }

