Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/powermgmt/powermgmt.c
    #if 0
    /* If need to use fIL as HOCO clock */
    {
        R_CGC_FclkUseFil();
        count = 2500;
    }
    #endif

    /* Wait 3s */
    while(count > 0)
    {
        count--;
        R_WDT_Restart();
    }

    /* Switch to normal clock */
    R_CGC_FclkUseFih();
}

/******************************************************************************
* Function Name : POWERMGMT_DisplayLCDDebugSign
* Interface     : static void POWERMGMT_DisplayLCDDebugSign(void)
* Description   : Display Sign on LCD for debug purpose
* Arguments     : None
* Return Value  : None
******************************************************************************/
PWR_FUNC static void POWERMGMT_DisplayLCDDebugSign(void)
{
    #if (POWERMGMT_DISPLAY_LCD_DEBUG_SYMBOL == TRUE)
    if (g_powermgmt_is_lvdvdd_first == 0) { LCD_DisplaySpSign(S_BILL); }
    if (g_reset_flag & 0x01) { LCD_DisplaySpSign(S_DATE); }
    if (g_reset_flag & 0x10) { LCD_DisplaySpSign(S_TIME); }
    if (g_reset_flag & 0x02) { LCD_DisplaySpSign(S_EARTH);}
    if (g_reset_flag & 0x04) { LCD_DisplaySpSign(S_REV); }
    #endif /* POWERMGMT_DISPLAY_LCD_DEBUG_SYMBOL == TRUE */
}

/******************************************************************************
* Function Name : POWERMGMT_DisplayLCDParams
* Interface     : static void POWERMGMT_DisplayLCDParams(float32_t kwh);
* Description   : Display KWh when CPU wake up in STOP mode
* Arguments     : float32_t kwh : KWh counter
* Return Value  : None
******************************************************************************/
PWR_FUNC static void POWERMGMT_DisplayLCDParams(float32_t kwh)
{
    LCD_ClearAll();

    /* Display measured value */
    LCD_DisplayFloat(kwh);

    /* Display "kWh" sign */
    LCD_DisplaySpSign(S_34);
    LCD_DisplaySpSign(S_35);
    LCD_DisplaySpSign(S_36);
    LCD_DisplaySpSign(S_37);
    LCD_DisplaySpSign(S_40);
    
    /* display HR */
     LCD_DisplaySpSign(S_9C);
 LCD_DisplaySpSign(S_9B);
 LCD_DisplaySpSign(S_9E);
 LCD_DisplaySpSign(S_9F);
 LCD_DisplaySpSign(S_9G1);
 LCD_DisplaySpSign(S_9G2);
 LCD_DisplaySpSign(S_10A);
 LCD_DisplaySpSign(S_10B);
 LCD_DisplaySpSign(S_10E);
 LCD_DisplaySpSign(S_10F);
 LCD_DisplaySpSign(S_10G1);
 LCD_DisplaySpSign(S_10G2);
 LCD_DisplaySpSign(S_10K);

    /* For debug purpose, not used when release */
    POWERMGMT_DisplayLCDDebugSign();

    POWERMGMT_SWDelayFor3Seconds();

    LCD_ClearAll();
}

/******************************************************************************
* Function Name : POWERMGMT_DisplayLCDError
* Interface     : static void POWERMGMT_DisplayLCDError(float32_t code)
* Description   : Display error code on LCD for debug purpose
* Arguments     : float32_t code : error code
* Return Value  : None
******************************************************************************/
PWR_FUNC static void POWERMGMT_DisplayLCDError(float32_t code)
{
    LCD_ClearAll();

    /* Display error code */
    LCD_DisplayFloat(code);

    /* For debug purpose, not used when release */
    POWERMGMT_DisplayLCDDebugSign();

    POWERMGMT_SWDelayFor3Seconds();

    LCD_ClearAll();
}

PWR_FUNC static powermgmt_mode_t powermgmt_switch_mode1_mode4(void)
{
    EM_Stop();
    
    /* PowerFail occur */
    if (g_event_state.power_failed.current_state == EVENT_STATE_RELEASE)
    {
        /* Assert event */
        EVENT_PowerFail(EVENT_STATE_ENTER);
        /* Log event with last sync snapshot to EventArgs */
        EVENT_Logging();
        /* Backup event state to prevent reset during sleep */
        EVENT_StorageBackup();
        /* Abnormal handling before sleep (release-->occur) to backup the last snapshot */
        R_HANDLER_BeforeMeterSleep();
    }
    else {
        /* Same state, not assert event */
    }
    
    /* Backup system states and DLMS data */
    STORAGE_Backup(STORAGE_ITEM_SYS_STATE | STORAGE_ITEM_DLMS);
    
    /* clear all the flag */
    g_powermgmt_flag.is_alarm_int     = 0;

    /* clear external event flag */
    g_intp_case_open_flag = 0;
    
    #if (POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE)
    EM_STANDBY_Start();
    g_powermgmt_standby_control.delay_release_count = 0;
    /* First using interval that greater than threshold */
    POWERMGMT_SetSamplingInterval(POWERMGMT_STANDBY_INTERVAL_HIGH);
    #endif /* POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE */

    stop_peripheral();
    
    /* Stop clock supply to all peripherals */
    PER0 = 0x00U;
    PER1 = 0x00U;
    PER2 = 0x00U;
    
    R_WDT_Restart();
    
    return POWERMGMT_MODE4;
}

PWR_FUNC static powermgmt_mode_t powermgmt_switch_mode3_mode4(void)
{
    stop_peripheral();
    
    /* Stop clock supply to all peripherals */
    PER0 = 0x00U;
    PER1 = 0x00U;
    PER2 = 0x00U;
    
    R_WDT_Restart();
    
    return POWERMGMT_MODE4;
}

PWR_FUNC static powermgmt_mode_t powermgmt_switch_mode4_mode1(void)
{
    /* Stop standby and do storage backup to save accumulated energy */
    #if (POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE)
    /* Release the standby mode */
    EM_STANDBY_Stop();
    R_RTC_Set_Alarm0Off();
    
    /* Do a storage backup to store energy accumulated during sleep (if any) */
    eeprom_enable();
    STORAGE_Backup(STORAGE_ITEM_SYS_STATE);
    eeprom_disable();

    /* Do a release in case neutral missing detected */
    g_powermgmt_standby_control.delay_release_count = POWERMGMT_STANDBY_DELAY_RELEASE_EVENT * 2;

    #endif /* POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE */
    
    /* Do startup flow */
    R_Systeminit();
    em_startup();

    /* Start peripheral + application */
    start_peripheral_and_app();

    R_HANDLER_MeterWakeup();

    /* PowerFail release */
    if (g_event_state.power_failed.current_state == EVENT_STATE_ENTER)
    {
        /* Assert event */
        EVENT_PowerFail(EVENT_STATE_RELEASE);
        /* Log event with custom parameters to EventArgs: captured time (next polling may not yet sync snapshot to EventArgs) */
        powermgmt_capture_rtc_calendar_counter_to_EventArgs();
        /* Logging done in mode1 (next polling) */
    }
    else {
        /* Same state, not assert event */
    }
    
    R_WDT_Restart();
    
