Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/powermgmt/powermgmt.c
    return POWERMGMT_MODE1;
}

PWR_FUNC static powermgmt_mode_t powermgmt_switch_mode4_mode3(void)
{
    /* Turn on VRTC, will be turn off in mode4 */
    VRTCEN = 1U;

    /* Process the key interrupt */
    if (KEY_IsUpPressed() == 1 && g_powermgmt_flag.is_alarm_int != 1)
    {
        float32_t energy;

        /* Supply power to EEPROM for reading the total tariff energy */
        eeprom_enable();

        energy = R_TARIFF_GetImportActiveEnergyTotal();

        /* Turn off supply to EEPROM to save power, not wait until transition to mode4 again */
        eeprom_disable();

        /* Turn on LCD to display energy information */
        R_LCD_PowerOn(0);
        POWERMGMT_DisplayLCDParams(energy);
        R_LCD_PowerOff();

        /* Call KeyPollingProcessing to acknowledge the flag */
        KEY_PollingProcessing();
        
        eeprom_enable();
    }

    /* Process the cover interrupt */
    if (g_intp_case_open_flag == 1)
    {
        /* CaseOpen occur */
        if (g_event_state.case_open.current_state == EVENT_STATE_RELEASE)
        {
            /* Only log event if having VDD or VBAT not low */
            eeprom_enable();

            /* Assert event */
            EVENT_CaseOpen(EVENT_STATE_ENTER);
            /* Log event with custom parameters to EventArgs: captured time */
            powermgmt_capture_rtc_calendar_counter_to_EventArgs();
            EVENT_Logging();
            /* Backup event state to prevent reset during sleep */
            EVENT_StorageBackup();
                
            eeprom_disable();
        }
        else {
            /* Same state, not assert event */
        }

        g_intp_case_open_flag = 0;
    }

    /* Process standby mode */
    if (g_powermgmt_flag.is_alarm_int == 1)
    {
        #if (POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE)
        POWERMGMT_StandBy_Calculate();
        #endif /* POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE */
        g_powermgmt_flag.is_alarm_int = 0;
    }
    
    R_WDT_Restart();
    
    return POWERMGMT_MODE3;
}

/******************************************************************************
* Function Name : POWERMGMT_PollingProcessing
* Interface     : void POWERMGMT_PollingProcessing(void)
* Description   : Polling process for power modes
* Arguments     : None
* Return Value  : None
******************************************************************************/
PWR_FUNC void POWERMGMT_PollingProcessing(void)
{
    #ifdef POWER_MANAGEMENT_ENABLE

    switch (g_powermgmt_current_mode)
    {
        case POWERMGMT_MODE1:
            if (POWERMGMT_DIRECT_IS_EXLVD_LOW() == 1)
            {
                g_powermgmt_current_mode = powermgmt_switch_mode1_mode4();
            }
            else
            {
                /* Check for power switch if turn on when power low for short duration */
                if (POWER_SW == 0)
                {
                    /* Turn it off to conserve power */
                    POWER_SW = 1;
                }
            }
            break;
        case POWERMGMT_MODE3:
            /* After process_mode3, go back to mode4 */
            {
                g_powermgmt_current_mode = powermgmt_switch_mode3_mode4();
            }
            break;
        case POWERMGMT_MODE4:
            if (POWERMGMT_DIRECT_IS_EXLVD_LOW() == 0)
            {
                g_powermgmt_current_mode = powermgmt_switch_mode4_mode1();
            }
            else
            {
                if( KEY_IsUpPressed() == 1 ||
                    g_intp_case_open_flag == 1 ||
                    g_powermgmt_flag.is_alarm_int == 1)
                {
                    g_powermgmt_current_mode = powermgmt_switch_mode4_mode3();
                }
                else
                {
                    //Stay in mode 4
                }
            }
            break;
        default:
            g_powermgmt_current_mode = POWERMGMT_MODE1;
            break;
    }
    
    if (g_powermgmt_current_mode == POWERMGMT_MODE4)
    {
        /* Before going to sleep, check again if either VDD or EXLVD low */
        if (POWERMGMT_DIRECT_IS_EXLVD_LOW() == 1)
        {
            /* Going to sleep mode */
            NOP();
            NOP();
            NOP();
            STOP();
            NOP();
            NOP();
            NOP();
            R_WDT_Restart();
        }
        else
        {
            /* Both VDD and EXLVD not low, should return to state check */
        }
    }

    #endif /* POWER_MANAGEMENT_ENABLE */
}

/***********************************************************************************************************************
* Function Name : POWERMGMT_GetMode
* Interface     : powermgmt_mode_t POWERMGMT_GetMode(void)
* Arguments     : None
* Return Value  : powermgmt_mode_t: Current power management mode
***********************************************************************************************************************/
PWR_FUNC powermgmt_mode_t POWERMGMT_GetMode(void)
{
    #ifdef POWER_MANAGEMENT_ENABLE
    return g_powermgmt_current_mode;
    #else
    return POWERMGMT_MODE1;
    #endif /* POWER_MANAGEMENT_ENABLE */
}

/***********************************************************************************************************************
* Function Name : POWERMGMT_SetMode
* Interface     : uint8_t POWERMGMT_SetMode(void)
* Description   : Set current power management mode
* Arguments     : powermgmt_mode_t: Current power management mode to set
* Return Value  : None
***********************************************************************************************************************/
PWR_FUNC void POWERMGMT_SetMode(powermgmt_mode_t mode)
{
    #ifdef POWER_MANAGEMENT_ENABLE
    /* Check input parameter */
    if (mode < POWERMGMT_MODE1 || mode > POWERMGMT_MODE4)
    {
        return; /* Do nothing */
    }

    g_powermgmt_current_mode = mode;
    #endif /* POWER_MANAGEMENT_ENABLE */
}

/******************************************************************************
* Function Name : POWERMGMT_VDD_InterruptCallback
* Interface     : void POWERMGMT_VDD_InterruptCallback(void)
* Description   : Callback function which is registered into LVDEXLVD ISR
* Arguments     : None
* Function Calls: None
* Return Value  : None
******************************************************************************/
PWR_FUNC void POWERMGMT_VDD_InterruptCallback(void)
{
    if(POWERMGMT_DIRECT_IS_VDD_LOW() == 0)
    {
        g_powermgmt_flag.is_vdd_low = 0;
    }
    else
    {
        g_powermgmt_flag.is_vdd_low = 1;
    }
}

