Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/powermgmt/powermgmt.c
/******************************************************************************
* Function Name : POWERMGMT_AC_InterruptCallback
* Interface     : void POWERMGMT_AC_InterruptCallback(void)
* Description   : Callback function which is registered into LVDEXLVD ISR
* Arguments     : None
* Function Calls: None
* Return Value  : None
******************************************************************************/
PWR_FUNC void POWERMGMT_AC_InterruptCallback(void)
{
    if(POWERMGMT_DIRECT_IS_EXLVD_LOW() == 0)
    {
        g_powermgmt_flag.is_ac_low = 0;
    }
    else
    {
        g_powermgmt_flag.is_ac_low = 1;
        /* Quickly turn on power switch before power failed below MCU running threshold*/
        POWER_SW = 0;
    }
}

/******************************************************************************
* Function Name : POWERMGMT_RTC_Periodic_InterruptCallback
* Interface     : void POWERMGMT_RTC_Periodic_InterruptCallback(void)
* Description   : Callback from RTC Periodic ISR to power management
* Arguments     : None
* Function Calls: None
* Return Value  : None
******************************************************************************/
PWR_FUNC void POWERMGMT_RTC_Periodic_InterruptCallback(void)
{
    #if (POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE)
    /* Delay count to release neutral missing event */
    if (g_powermgmt_standby_control.delay_release_count > 0) {
        g_powermgmt_standby_control.delay_release_count--;
        if (g_powermgmt_standby_control.delay_release_count == 0) {
            if (g_event_state.neutral_missing.current_state == EVENT_STATE_ENTER) 
            {
                /* Assert event */
                EVENT_NeutralMissing(EVENT_STATE_RELEASE);
                /* EventArgs synced to snapshot, Logging done in mode1 (next polling) */
            } 
            else {
                /* Same state, not assert event */
            }
        }
    }
    #endif /* POWER_MANGEMENT_STANDBY_PROCESSING_ENABLE == TRUE */

    g_powermgmt_flag.is_rtc_int = 1;
}

/******************************************************************************
* Function Name : POWERMGMT_RTC_Alarm_InterruptCallback
* Interface     : void POWERMGMT_RTC_Alarm_InterruptCallback(void)
* Description   : Callback from RTC alarm ISR to power management
* Arguments     : None
* Function Calls: None
* Return Value  : None
******************************************************************************/
PWR_FUNC void POWERMGMT_RTC_Alarm_InterruptCallback(void)
{
    g_powermgmt_flag.is_alarm_int = 1;
}
